Public Attributes | List of all members
API_ColumnQuantity Struct Reference
Element Manager API
Describes the different calculated values for columns. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | coreSurface
surface of the column core
double  | veneSurface
surface of the column veneer
double  | coreVolume
volume of the column core
double  | veneVolume
volume of the column veneer
double  | minHeight
minimum height of the column
double  | maxHeight
maximum height of the column
double  | perimeter
perimeter of the column
double  | area
area of the column
double  | coreGrossSurf
gross surface of the core
double  | veneGrossSurf
gross surface of the veneer
double  | crossSectionAreaCutBegin
area of the columns begin cross section
double  | crossSectionAreaCutEnd
area of the columns end cross section
double  | coreGrossVolume
gross volume of the core
double  | veneGrossVolume
gross volume of the veneer
double  | coreTopSurf
surface of the core top
double  | coreBotSurf
surface of the core bottom
double  | veneTopSurf
surface of the veneer top
double  | veneBotSurf
surface of the veneer bottom
double  | coreGrossTopBotSurf
gross surface of the core top and bottom
double  | veneGrossTopBotSurf
gross surface of the veneer top and bottom
Detailed Description
Describes the different calculated values for columns.
Remarks
See also the column description in Appendix A of the GDL Reference manual.
Member Data Documentation
◆ area
 API_ColumnQuantity::area
area of the column
◆ coreBotSurf
 API_ColumnQuantity::coreBotSurf
surface of the core bottom
◆ coreGrossSurf
 API_ColumnQuantity::coreGrossSurf
gross surface of the core
◆ coreGrossTopBotSurf
 API_ColumnQuantity::coreGrossTopBotSurf
gross surface of the core top and bottom
◆ coreGrossVolume
 API_ColumnQuantity::coreGrossVolume
gross volume of the core
◆ coreSurface
 API_ColumnQuantity::coreSurface
surface of the column core
◆ coreTopSurf
 API_ColumnQuantity::coreTopSurf
surface of the core top
◆ coreVolume
 API_ColumnQuantity::coreVolume
volume of the column core
◆ crossSectionAreaCutBegin
 API_ColumnQuantity::crossSectionAreaCutBegin
area of the columns begin cross section
◆ crossSectionAreaCutEnd
 API_ColumnQuantity::crossSectionAreaCutEnd
area of the columns end cross section
◆ maxHeight
 API_ColumnQuantity::maxHeight
maximum height of the column
◆ minHeight
 API_ColumnQuantity::minHeight
minimum height of the column
◆ perimeter
 API_ColumnQuantity::perimeter
perimeter of the column
◆ veneBotSurf
 API_ColumnQuantity::veneBotSurf
surface of the veneer bottom
◆ veneGrossSurf
 API_ColumnQuantity::veneGrossSurf
gross surface of the veneer
◆ veneGrossTopBotSurf
 API_ColumnQuantity::veneGrossTopBotSurf
gross surface of the veneer top and bottom
◆ veneGrossVolume
 API_ColumnQuantity::veneGrossVolume
gross volume of the veneer
◆ veneSurface
 API_ColumnQuantity::veneSurface
surface of the column veneer
◆ veneTopSurf
 API_ColumnQuantity::veneTopSurf
surface of the veneer top
◆ veneVolume
 API_ColumnQuantity::veneVolume
volume of the column veneer